123456*8901234567890123456789012345678901234567890
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTE-TEST.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM  PIC 9(1)V9(5) VALUE 0.

       PROCEDURE DIVISION.
           PERFORM 10000 TIMES
               ADD 0.00001 TO NUM
           END-PERFORM.
           DISPLAY NUM
           STOP RUN.

      * Result: 0.10000
