123456*8901234567890123456789012345678901234567890
       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     HELLO-WORLD.

       PROCEDURE       DIVISION.
           DISPLAY "Hello, world.".
           STOP    RUN.

